---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FabricFailures.CannotPlaceFabricAreaWarn
source: html/5adf8036-f82c-171c-8dc8-890f86b702c6.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FabricFailures.CannotPlaceFabricAreaWarn Property

Can't find a host for Fabric Area.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotPlaceFabricAreaWarn { get; }
```